-- Сессия_1
-- ------------Начало транзакции(begin)---------------------
begin ;/*1*/
update pizzeria set rating=1 where id=1;/*3 -Меняем данные в таблице-*/
update pizzeria set rating=3 where id=2;/*5 -Меняем данные в таблице-*/
commit;/*7*/
-- ------------Конец транзакции(commit)---------------------




-- Сессия_2
-- ------------Начало транзакции(begin)---------------------
begin ;/*2*/
update pizzeria set rating=2 where id=2;/*4 -Меняем данные в таблице-*/
update pizzeria set rating=4 where id=1;/*6 -Меняем данные в таблице-*/
commit;/*8*/
-- ------------Конец транзакции(commit)---------------------